[
  {
    "id": "developer-portfolio",
    "title": "Developer Portfolio",
    "subheader": "Personal Showcase of Projects and Skills",
    "affiliation": "Myself",
    "description": "A developer portfolio showcasing my projects and skills. Built with React, Vite, TypeScript, Material-UI, and Tailwind CSS. Designed to present my work in an organized and visually appealing manner.",
    "techStack": [
      { "name": "TypeScript", "cardType": "language" },
      { "name": "React", "cardType": "frontend" },
      { "name": "React Router", "cardType": "frontend" },
      { "name": "AWS Amplify", "cardType": "backend" },
      { "name": "Material-UI", "cardType": "design" },
      { "name": "Emotion", "cardType": "design" },
      { "name": "Day.js", "cardType": "library" },
      { "name": "Vite", "cardType": "tooling" },
      { "name": "ESLint", "cardType": "tooling" },
      { "name": "Tailwind CSS", "cardType": "design" },
      { "name": "Code Splitting", "cardType": "tooling" }
    ],
    "links": [
      {
        "type": "code",
        "href": "https://github.com/sapphybara/portfolio"
      }
    ],
    "roles": ["developer", "designer"],
    "contributions": [
      "Developed the entire frontend of the portfolio using React and TypeScript.",
      "Designed the portfolio using Material-UI and Tailwind CSS to create a visually appealing and user-friendly interface.",
      "Implemented a responsive design to ensure the portfolio looks good on all devices."
    ],
    "problemSolving": [
      "Created a dynamic project display system that allows me to easily add, remove, or update projects.",
      "Used Material-UI and Tailwind CSS to create a visually appealing and user-friendly interface."
    ],
    "shortDescription": "A website to showcase my expertise as a developer and designer."
  },
  {
    "id": "hyscan",
    "title": "HySCAN",
    "subheader": "Hydrogen Safety Codes & Standards Applicability Navigator",
    "affiliation": "Pacific Northwest National Laboratory",
    "description": "As one of the developers, I contributed to HySCAN, a web application with intuitive, accessible workflows, designed to support users in navigating hydrogen (H2) codes and standards. It is a part of the H2Tools Suite, which is a group of tools developed and maintained by Pacific Northwest National Laboratory. It efficiently identified and categorized areas of adherence, empowering users with tailored solutions for enhanced safety and efficiency.",
    "techStack": [
      { "name": "React", "cardType": "frontend" },
      { "name": "styled-components", "cardType": "frontend" },
      { "name": "Figma", "cardType": "design" },
      { "name": "Node", "cardType": "backend" },
      { "name": "Jest", "cardType": "testing" }
    ],
    "links": [
      {
        "type": "live",
        "href": "https://h2tools.org/hyscan"
      }
    ],
    "shareholderDescription": "HySCAN was jointly developed by Sandia National Laboratories (Sandia), National Renewable Energy Laboratory (NREL), and Pacific Northwest National Laboratory (PNNL) and operated and maintained by PNNL, with funding from the U.S. Department of Energy's Office of Energy Efficiency and Renewable Energy (EERE) under the Hydrogen and Fuel Cell Technologies Office (HFTO).",
    "roles": ["developer"],
    "contributions": [
      "Created and maintained React components for the application using styled-components.",
      "Key to the creation of algorithms to understand the user's system, identify applicable codes and standards, and group related questions.",
      "Implemented bug fixes and design changes to improve the user experience after demos and sponsor feedback.",
      "Developed a dynamic question system where each component has corresponding questions, with additional questions based on conditional responses."
    ],
    "problemSolving": [
      "Developed a solution to dynamically generate questions based on the user's system and the codes and standards applicable to it.",
      "Designed a system to categorize and group questions based on the codes and standards they relate to.",
      "Implemented responsive design principles for optimal viewing across devices.",
      "Created a mechanism to relay optional references to related documents based on the user's answers."
    ],
    "shortDescription": "An application to support those who utilize hydrogen (H2) in identifying hydrogen-specific codes and standard documents that are relevant to their systems.",
    "images": [
      {
        "src": "/images/hyscan/1.jpeg",
        "alt": "HySCAN Home Page"
      },
      {
        "src": "/images/hyscan/2.jpeg",
        "alt": "HySCAN Disclaimer Page"
      },
      {
        "src": "/images/hyscan/3.jpeg",
        "alt": "HySCAN Component Selection List"
      },
      {
        "src": "/images/hyscan/4.jpeg",
        "alt": "HySCAN component card list"
      },
      {
        "src": "/images/hyscan/5.jpeg",
        "alt": "HySCAN Questionnaire"
      },
      {
        "src": "/images/hyscan/6.jpeg",
        "alt": "HySCAN Results Page: suggested codes and standards"
      },
      {
        "src": "/images/hyscan/7.jpeg",
        "alt": "HySCAN Results Page: related questions"
      }
    ]
  },
  {
    "id": "explainable-ai",
    "title": "Explainable AI: Exposing the Black Box",
    "subheader": "Understanding AI Models and Predictions",
    "affiliation": "Pacific Northwest National Laboratory",
    "description": "As part of a larger venture, this work focused on Explainable AI (XAI) to help stakeholders understand complex AI models. The project explored different XAI methods and implemented SHAP (Shapley Additive exPlanations), a Python package for XAI. The project explored different XAI methods and implemented SHAP (Shapley Additive exPlanations), a Python package for XAI. The designs I created were seen as viable by the stakeholders, which was instrumental in securing an additional $50k in funding for this and other parts of the project.",
    "techStack": [
      { "name": "Python", "cardType": "language" },
      { "name": "AI", "cardType": "frontend" },
      { "name": "Adobe XD", "cardType": "design" },
      { "name": "Blueprint.js", "cardType": "design" }
    ],
    "shareholderDescription": "This research was part of a larger, multi-lab venture, supported by the National Nuclear Security Administration, Office of Defense Nuclear Nonproliferation Research And Development.",
    "roles": ["designer", "researcher"],
    "contributions": [
      "Designed an intuitive interface to visualize the data output from the AI models, aiding in the understanding of complex AI models."
    ],
    "problemSolving": [
      "Developed a user-friendly interface to present the results of black box AI models using SHAP.",
      "Designed a system to generate both local and global explanations, making the AI models more understandable for stakeholders."
    ],
    "shortDescription": "A research project to understand and interpret black box AI models using Explainable AI methods, one part of a larger venture. My primary role was designing the interface to visualize the AI model outputs.",
    "images": [
      {
        "src": "/images/explainable-ai/1.png",
        "alt": "Explainable AI Interface"
      },
      {
        "src": "/images/explainable-ai/2.png",
        "alt": "Explainable AI Interface"
      },
      {
        "src": "/images/explainable-ai/3.png",
        "alt": "Explainable AI Interface"
      },
      {
        "src": "/images/explainable-ai/4.png",
        "alt": "Explainable AI Interface"
      },
      {
        "src": "/images/explainable-ai/5.png",
        "alt": "Explainable AI Interface"
      },
      {
        "src": "/images/explainable-ai/6.png",
        "alt": "Explainable AI Interface"
      }
    ]
  }
]
